/*Завдання 1
Гра: "Камінь, ножиці, папір"
Опис гри:
Користувач грає проти комп'ютера в класичну гру "Камінь, ножиці, папір". Програма запитує вибір користувача, генерує випадковий вибір для комп'ютера, визначає переможця та виводить результат.
Кроки для виконання завдання:
1. Введення вибору користувача:
   - Використайте `prompt` для запиту вибору користувача (камінь, ножиці, папір).
2. Генерація вибору комп'ютера:
   - Використайте `Math.random()` для випадкового вибору між каменем, ножицями і папером.
3. Визначення переможця:
   - Використайте умовні конструкції для визначення переможця за правилами гри:
     - Камінь б'є ножиці.
     - Ножиці б'ють папір.
     - Папір б'є камінь.
     - Однакові вибори - нічия.
4. Виведення результату:
   - Використайте `alert` для виведення вибору користувача, вибору комп'ютера та результату гри.

Додаткові завдання:
1. Додати можливість гри кілька раундів з підрахунком загального рахунку.
2. Додати можливість користувачеві вийти з гри за допомогою спеціальної команди (наприклад, введення "вихід")
*/ 

function playGame() {
    let userScore = 0;
    let computerScore = 0;
    let rounds = 0;

    while (true) {
        let userChoice = prompt("Введіть на вибір: камінь, ножиці, папір. Або 'вихід' для завершення гри.").toLowerCase();
        if (userChoice === 'вихід') {
            alert(`Гра завершена. Загальний рахунок: Користувач: ${userScore} - Комп'ютер ${computerScore}`);
            break;
        }

        let choices = ['камінь', 'ножиці', 'папір'];
        let computerChoice = choices[Math.floor(Math.random() * 3)];

        alert(`Ваш вибір: ${userChoice}\nВибір комп'ютера: ${computerChoice}`);

        if (userChoice === computerChoice) {
            alert("Нічия!");
        } else if (
            (userChoice === 'камінь' && computerChoice === 'ножиці') ||
            (userChoice === 'ножиці' && computerChoice === 'папір') ||
            (userChoice === 'папір' && computerChoice === 'камінь')) {

            alert("Ви виграли!");
            userScore++;
        } else {
            alert("Ви програли");
            computerScore++;
        }
        rounds++;
        alert(`Рахунок після ${rounds} раундів: Користувач ${userScore} - Комп'ютер ${computerScore}`);

    }
}
playGame();